@posquit0 @justinretzolk I had the same issue.

When creating the third-level folder, terraform always tries to recreate it.

Code:
```
resource "aws_quicksight_folder" "folder-1" {
    folder_id = "folder-1"
    name      = "folder-1"
    aws_account_id = local.aws_account_id
    permissions {
      actions = local.quicksight_folder_admin_actions
      principal = local.admin_role
    }
}


resource "aws_quicksight_folder" "folder-2" {
    folder_id = "folder-2"
    name      = "folder-2"
    aws_account_id = local.aws_account_id
    parent_folder_arn = aws_quicksight_folder.folder-1.arn
    permissions {
      actions = local.quicksight_folder_admin_actions
      principal = local.admin_role
    }
}

resource "aws_quicksight_folder" "folder-3" {
    folder_id = "folder-3"
    name      = "folder-3"
    aws_account_id = local.aws_account_id
    parent_folder_arn = aws_quicksight_folder.folder-2.arn
    permissions {
      actions = local.quicksight_folder_admin_actions
      principal = local.admin_role
    }
}
```
Then running apply twice:
```
module.this.aws_quicksight_folder.folder-3 must be replaced
-/+ resource "aws_quicksight_folder" "folder-3" {
      ~ arn               = "arn:aws:quicksight:eu-central-1:-:folder/folder-3" -> (known after apply)
      ~ created_time      = "2023-07-18T14:18:09Z" -> (known after apply)
      ~ folder_path       = [
          - "arn:aws:quicksight:eu-central-1:-:folder/folder-1",
          - "arn:aws:quicksight:eu-central-1:-:folder/folder-2",
        ] -> (known after apply)
      ~ id                = "-,folder-3" -> (known after apply)
      ~ last_updated_time = "2023-07-18T14:18:09Z" -> (known after apply)
        name              = "folder-3"
      ~ parent_folder_arn = "arn:aws:quicksight:eu-central-1:-:folder/folder-1" -> "arn:aws:quicksight:eu-central-1:-:folder/folder-2" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
```
